In [5]:
#Cargar las librerias a utilizar
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [11]:
# Leer el Dataframe
aircraftdf = pd.read_csv(r'C:\Users\flore\OneDrive\Documents\Proyecto Final Clonado\ProyectoIntegradorDAFT08\Data\Data Original\aircrafts_data.csv')

In [12]:
# Mostrar los tipos de datos de las columnas
print("Tipos de datos para la tabla 'aircrafts_data':")
print(aircraftdf.dtypes)

Tipos de datos para la tabla 'aircrafts_data':
aircraft_code    object
model            object
range             int64
dtype: object

In [18]:
np.shape(aircraftdf)

(9, 3)

In [19]:
# Mostrar las primeras filas
aircraftdf.head()

  aircraft_code                model  range
0           773       Boeing 777-300  11100
1           763       Boeing 767-300   7900
2           SU9  Sukhoi Superjet-100   3000
3           320      Airbus A320-200   5700
4           321      Airbus A321-200   5600

In [14]:
# Eliminar las comillas de la columna 'model'
aircraftdf['model'] = aircraftdf['model'].str.strip('"')

# Mostrar las primeras filas del DataFrame modificado
print(aircraftdf.head())

  aircraft_code                model  range
0           773       Boeing 777-300  11100
1           763       Boeing 767-300   7900
2           SU9  Sukhoi Superjet-100   3000
3           320      Airbus A320-200   5700
4           321      Airbus A321-200   5600

In [15]:
# Comprobar valores nulos
print(aircraftdf.isnull().sum())

aircraft_code    0
model            0
range            0
dtype: int64

In [16]:
aircraftdf.describe()

              range
count      9.000000
mean    5344.444444
std     3013.764718
min     1200.000000
25%     3000.000000
50%     5600.000000
75%     6700.000000
max    11100.000000

In [ ]:
aircraftdf.to_csv("aircraft_data_clean.csv", index=False)

**Esta tabla contiene informaci칩n b치sica sobre cada tipo de aeronave,**
**incluyendo un c칩digo de identificaci칩n, el modelo y el rango de vuelo.**